---
type: ZoneEquipment
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 5
tags: [revit-api, class]
---

# ZoneEquipment

`Autodesk.Revit.DB.Mechanical.ZoneEquipment` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2020.1 | `public static ZoneEquipment Create ( Document document , string name )` |
| Method | GetAssociatedZoneEquipment | — | `` |
| Method | GetZoneEquipmentData | 2020.1 | `public ZoneEquipmentData GetZoneEquipmentData ()` |
| Method | MoveSpaceToEquipment | 2020.1 | `public static void MoveSpaceToEquipment ( Document document , ISet < ElementId > analyticalSpaceSet , ElementId originalZoneEquipmentId , ElementId targetZoneEquipmentId )` |
| Property | Parameter | — | `` |